# AreVertexPointsValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wire..::..AreVertexPointsValid Method
Wire Class See Also
---
Checks if the given vertex points are valid for the wire.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static bool AreVertexPointsValid(
	IList<XYZ> vertexPoints,
	Connector startConnector,
	Connector endConnector
)
```

Visual Basic
---
```text
Public Shared Function AreVertexPointsValid ( _
	vertexPoints As IList(Of XYZ), _
	startConnector As Connector, _
	endConnector As Connector _
) As Boolean
```

Visual C++
---
```text
public:
static bool AreVertexPointsValid(
	IList<XYZ^>^ vertexPoints,
	Connector^ startConnector,
	Connector^ endConnector
)
```

# ### Parameters
vertexPoints
    Type: System.Collections.Generic..::..IList<(Of <(<'XYZ>)>)> The vertex points.
startConnector
    Type: Autodesk.Revit.DB..::..Connector The start connector of the wire.
endConnector
    Type: Autodesk.Revit.DB..::..Connector The end connector of the wire.
# ### Return Value
True if the given vertex points are valid, false otherwise.
# Remarks
X and Y values are compared of the vertices.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Wire Class
Autodesk.Revit.DB.Electrical Namespace